tiedemannt/STM32AtollicApp/Src/lgs_bluetooth.c
/**
  ******************************************************************************
  * File Name          : lgs_bluetooth.c
  * Description        : Implementation file
  *
  *  Created on: 29.12.2018
  *  Author: Tobias Tiedemann
  ******************************************************************************
  */


/**
 * Includes
 */
#include "lgs_bluetooth.h"

#include <stdio.h>
#include <string.h>
#include <stdlib.h>

#include "hci.h"
#include "hci_le.h"
#include "hci_tl.h"
#include "hci_const.h"
#include "link_layer.h"

#include "bluenrg_utils.h"
#include "stm32l0_nucleo_l053r8.h"
#include "bluenrg_gap.h"
#include "bluenrg_gap_aci.h"
#include "bluenrg_gatt_aci.h"
#include "bluenrg_hal_aci.h"
#include "bluenrg_aci_const.h"
#include "sm.h"
#include "stm32l0xx_hal_tim.h"

//Symbol: Wird für Evaluationsboard kompiliert?
#define EVALUATIONBOARD


/**
 * MAKRO DEFINITIONS
 */
#define COPY_UUID_128(uuid_struct, uuid_15, uuid_14, uuid_13, uuid_12, uuid_11, uuid_10, uuid_9, uuid_8, uuid_7, uuid_6, uuid_5, uuid_4, uuid_3, uuid_2, uuid_1, uuid_0) \
do {\
    uuid_struct[0] = uuid_0; uuid_struct[1] = uuid_1; uuid_struct[2] = uuid_2; uuid_struct[3] = uuid_3; \
        uuid_struct[4] = uuid_4; uuid_struct[5] = uuid_5; uuid_struct[6] = uuid_6; uuid_struct[7] = uuid_7; \
            uuid_struct[8] = uuid_8; uuid_struct[9] = uuid_9; uuid_struct[10] = uuid_10; uuid_struct[11] = uuid_11; \
                uuid_struct[12] = uuid_12; uuid_struct[13] = uuid_13; uuid_struct[14] = uuid_14; uuid_struct[15] = uuid_15; \
}while(0)

//Data Object Bluetooth Data
s_environmentData m_environmentData;

//Handles, saved as a struct
struct s_handles
{
	//Service Handles
	uint16_t	m_gapServiceHandle;				//Service Handle GAP
	//--
	uint16_t 	m_environmentServiceHandle;		//Service Handle Environment
	uint16_t	m_configurationServiceHandle;	//Service Handle Configuration

	//Characteristic Data Handles
	uint16_t    m_deviceNameCharHandle;			//Characteristic Handle Device Name
	uint16_t	m_appearanceCharHandle;			//Characteristic Handle Apperance
	//--
	uint16_t 	m_environmentCharBrightHandle;	//Characteristic Handle Bright Flag
	uint16_t 	m_environmentCharTempHandle;	//Characteristic Handle Temperature
	uint16_t 	m_environmentCharVOCHandle;		//Characteristic Handle VOC
	uint16_t 	m_environmentCharCO2Handle;		//Characteristic Handle CO2
	uint16_t 	m_environmentCharHumidityHandle;//Characteristic Handle Air Humidity
	uint16_t 	m_environmentCharPressureHandle;//Characteristic Handle Air Pressure

	//Characteristic Settings Handles
	uint16_t    m_configurationsRepRateHandle; 	//Characteristic Handle Reprate Setting
	uint16_t	m_configurationsOutputActive;	//Characteristic Handle Output Flag
	uint16_t	m_configurationsCriticTemperature; //Characteristic Handle kritische Temperatur
	uint16_t	m_configurationsCriticVOC;		//Characteristic Handle kritischer VOC Wert
	uint16_t	m_configurationsCriticCo2;		//Characteristic Handle kritischer CO2 Wert
	uint16_t	m_configurationsCriticHumidity;	//Characteristic Handle kritische Feuchte
	uint16_t	m_configurationsCriticPressure;	//Characteristic Handle kritischer Druck
}m_serviceHandles;



//General Variables
uint8_t set_connectable = TRUE;
uint16_t connection_handle = 0;
int     connected;
uint8_t  notification_enabled = FALSE;
uint8_t bnrg_expansion_board = IDB05A1; //IDB5 expansion board
uint8_t bdaddr[BDADDR_SIZE];
uint32_t msSinceUpdate = 0;

Service_UUID_t 	service_uuid;
Char_UUID_t 	char_uuid;


//Service UUID
#define GET_ENVIRONMENT_SERVICE_UUID(uuid_struct)   \
	COPY_UUID_128(uuid_struct,0x7d,0x36,0xee,0xd5,0xca,0x05,0x42,0xf3,0x86,0x7e,0x4d,0x80,0x0a,0x45,0x9c,0xa1)
#define GET_CONFIGURATION_SERVICE_UUID(uuid_struct)   \
	COPY_UUID_128(uuid_struct,0x7d,0x36,0xee,0xd5,0xca,0x05,0x42,0xf3,0x86,0x7e,0x4d,0x80,0x0a,0x45,0x9c,0xa2)

//Daten UUID
#define GET_ENVIRONMENT_CHAR_BRIGHT_UUID(uuid_struct)   \
	COPY_UUID_128(uuid_struct,0xc5,0x09,0x56,0xf6,0xcb,0x78,0x48,0x7e,0x95,0x66,0xb8,0x83,0xff,0x3e,0x5d,0x53)
#define GET_ENVIRONMENT_CHAR_TEMP_UUID(uuid_struct)   \
	COPY_UUID_128(uuid_struct,0xb3,0x31,0x02,0xeb,0x43,0xa0,0x4d,0xa1,0x81,0x83,0xed,0x16,0x9c,0x0f,0x17,0x20)
#define GET_ENVIRONMENT_CHAR_VOC_UUID(uuid_struct)   \
	COPY_UUID_128(uuid_struct,0x6b,0xb0,0x14,0xe9,0xa0,0xc1,0x47,0xb7,0x93,0x9d,0xf9,0x7b,0x8e,0x4f,0x78,0x77)
#define GET_ENVIRONMENT_CHAR_CO2_UUID(uuid_struct)   \
	COPY_UUID_128(uuid_struct,0x4e,0x1f,0xca,0xdd,0xcd,0xbf,0x46,0xbc,0x8f,0xaa,0x4b,0x06,0x32,0x0c,0xfa,0x2c)
#define GET_ENVIRONMENT_CHAR_HUMIDITY_UUID(uuid_struct)   \
	COPY_UUID_128(uuid_struct,0x4e,0x31,0x1c,0xb9,0xa6,0x8b,0x44,0xb7,0xaa,0x97,0xa5,0x91,0x19,0x0a,0xa0,0x8e)
#define GET_ENVIRONMENT_CHAR_PRESSURE_UUID(uuid_struct)   \
	COPY_UUID_128(uuid_struct,0x66,0x6b,0x7e,0x99,0xe9,0x73,0x48,0x60,0x90,0x06,0xc7,0x8c,0xb9,0x5d,0xa5,0xaa)

//Settings UUID
#define GET_ENVIRONMENT_CHAR_SETTINGS_REPRATE_UUID(uuid_struct)   \
	COPY_UUID_128(uuid_struct,0x28,0x6c,0xc2,0x04,0x4b,0x3f,0x4f,0x82,0x8e,0xbb,0x66,0x73,0x72,0xb1,0x56,0x69)
#define GET_ENVIRONMENT_CHAR_SETTINGS_CRITTEMP_UUID(uuid_struct)   \
	COPY_UUID_128(uuid_struct,0x28,0x6c,0xc2,0x04,0x4b,0x3f,0x4f,0x82,0x8e,0xbb,0x66,0x73,0x72,0xb1,0x56,0x6a)
#define GET_ENVIRONMENT_CHAR_SETTINGS_CRITPRES_UUID(uuid_struct)   \
	COPY_UUID_128(uuid_struct,0x28,0x6c,0xc2,0x04,0x4b,0x3f,0x4f,0x82,0x8e,0xbb,0x66,0x73,0x72,0xb1,0x56,0x6b)
#define GET_ENVIRONMENT_CHAR_SETTINGS_CRITCO2_UUID(uuid_struct)   \
	COPY_UUID_128(uuid_struct,0x28,0x6c,0xc2,0x04,0x4b,0x3f,0x4f,0x82,0x8e,0xbb,0x66,0x73,0x72,0xb1,0x56,0x6c)
#define GET_ENVIRONMENT_CHAR_SETTINGS_CRITHUM_UUID(uuid_struct)   \
	COPY_UUID_128(uuid_struct,0x28,0x6c,0xc2,0x04,0x4b,0x3f,0x4f,0x82,0x8e,0xbb,0x66,0x73,0x72,0xb1,0x56,0x6d)
#define GET_ENVIRONMENT_CHAR_SETTINGS_CRITVOC_UUID(uuid_struct)   \
	COPY_UUID_128(uuid_struct,0x28,0x6c,0xc2,0x04,0x4b,0x3f,0x4f,0x82,0x8e,0xbb,0x66,0x73,0x72,0xb1,0x56,0x6e)
#define GET_ENVIRONMENT_CHAR_SETTINGS_OUTPUTACT_UUID(uuid_struct)   \
	COPY_UUID_128(uuid_struct,0x28,0x6c,0xc2,0x04,0x4b,0x3f,0x4f,0x82,0x8e,0xbb,0x66,0x73,0x72,0xb1,0x56,0x6f)

/**
 * Private function prototypes
 */
void 		LGS_Process(void);
void 		LGS_SetAddress(uint8_t* bdaddr, uint8_t hwVersion, uint16_t fwVersion);
tBleStatus  LGS_AddEnvironmentService(void);
void 		GAP_DisconnectionComplete_CB(void);
void 		GAP_ConnectionComplete_CB(uint8_t addr[6], uint16_t handle);
tBleStatus 	LGS_UpdateStackData(void);
void 		Read_Request_CB(uint16_t handle);
void 		Write_Request_CB(uint16_t handle, uint8_t data_length, uint8_t* data);



/**
 * DEFINITION Public LGS_BLE_Init
 * -> Initialize the peripherals and the BLE Stack
 * -> Aufruf in main()
 */
void LGS_BLE_Init(void)
{
	uint8_t  hwVersion;						//HW Version BlueNRG
	uint16_t fwVersion;						//FW Version BlueNRG
	int ret;								//Verarbeitung von Rückgabewerten
	const char * name = "LGS";				//Device Name

