tiedemannt/STM32AtollicApp/Src/lgs_bluetooth.c
#ifdef EVALUATIONBOARD
	BSP_LED_Init(LED2);
#endif

	//Init HCI:
	hci_init(LGS_UserNotify, NULL);				//Initialize HCI (Host-Controller-Interface) Callback
	getBlueNRGVersion(&hwVersion, &fwVersion);	//Get Hard-/Firmware Version

	//Set MAC Adress
	hci_reset(); 								//Reset HCI (Notwendig um MAC Adresse zu ändern)
	HAL_Delay(100);								//100ms warten
	LGS_SetAddress(bdaddr,hwVersion, fwVersion);//Call LGS_SetAddress to define MAC Adress
	ret = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
	                                  CONFIG_DATA_PUBADDR_LEN,
	                                  bdaddr);	//Write MAC Adress to Adapter
	if (ret) while(1);							//Fehler? -> while(1)

	//Init General Attributes Profile Service
	ret = aci_gatt_init();  					//Init GATT
	if (ret) while(1);							//Fehler? -> while(1)

	//Init General Access Profile Service
	ret = aci_gap_init_IDB05A1(
			GAP_PERIPHERAL_ROLE_IDB05A1, 			//ROLE: PERIPHERAL/BROADCASTER/CENTRAL/OBSERVER
			0, 										//Privacy Enabled Flag
			0x03, 									//Device Name Length: LGS
			&m_serviceHandles.m_gapServiceHandle,	//GAP Service Handle
			&m_serviceHandles.m_deviceNameCharHandle,//Name Characteristic Handle
			&m_serviceHandles.m_appearanceCharHandle);//Apperance Characteristic Handle
	if (ret) while(1);							//Fehler? -> while(1)

	//Set Device Name
	ret = aci_gatt_update_char_value(
			m_serviceHandles.m_gapServiceHandle, 	//GAP Service Handle
			m_serviceHandles.m_deviceNameCharHandle,//Name Characteristic Handle
			0,                					//CharValOffset; Muss 0 sein, damit nächster Wert genommen wird:
			strlen(name), 						//Länge des Characteristic Werts
			(uint8_t *)name);					//Der Characteristic Wert
	if (ret) while(1);							//Fehler? -> while(1)

	//Set Authentication Requrements
	ret = aci_gap_set_auth_requirement(
			MITM_PROTECTION_REQUIRED,			//MITM Mode: REQUIRED/NOT_REQUIRED
			OOB_AUTH_DATA_ABSENT,				//OOb Data present? ABSENT/PRESENT
			NULL,								//OOB Data
			7,									//Minimum size of the encryption key to be used during the pairing process
			16,									//Maximum size of the encryption key to be used during the pairing process
			USE_FIXED_PIN_FOR_PAIRING,			//•USE_FIXED_PIN_FOR_PAIRING / •DONOT_USE_FIXED_PIN_FOR_PAIRING
			123456,								//PIN
			BONDING);							//Bonding Mode: BONDING/NO_BONDING
	if (ret) while(1);							//Fehler? -> while(1)


	//###############################
	//BLE STACK IST NUN INITIALISIERT
	//###############################

	//Weitere Services Initialisieren
	ret = LGS_AddEnvironmentService();			//Init Environment Service
	if (ret) while(1);							//Fehler? -> while(1)

	//Set Output Power Level
	(void)aci_hal_set_tx_power_level(
			1,									//Enable High Power Flag: 0/1
			PA_LEVEL);							//PA_Level: 0-7; Default: 4
}

/**
 * BlueNRG-MS background task
 * -> Triggered in Main Loop
 */
void LGS_BLE_Process(void)
{
	LGS_Process();
	hci_user_evt_proc();
}

/**
 * Define the MAC Adress of the Device
 */
void LGS_SetAddress(uint8_t* bdaddr, uint8_t hwVersion, uint16_t fwVersion)
{
	//Random

	uint8_t i;

	/* Initialize a random seed */
	srand (HAL_GetTick() + hwVersion + fwVersion);

	for (i=0; i<5; i++) {
		bdaddr[i] = rand()&0xFF;
	}
	bdaddr[i] = 0xD0;
}

/**
 * Specific LGS Handling
 */
void LGS_Process(void)
{
	//Initial den Discovery Modus setzen
	if (set_connectable)
	{
		LGS_SetDiscoverableMode();
		set_connectable = FALSE;
		LGS_BLE_UpdateDefaultSettings(); //for readonly
	}

	//Beispielapplikation togglet hier die LED
#ifdef EVALUATIONBOARD
	BSP_LED_Toggle(LED2);
#endif

	if (connected)
	{
		//Für Nucleo Board: Zufällige Werte erzeugen
#ifdef EVALUATIONBOARD
		srand(HAL_GetTick()); //Set Seed for Random Generator

		//Toggle Bright Flag
		if(m_environmentData.m_environmentBright == 1)
		{
			m_environmentData.m_environmentBright = 0;
		}
		else
		{
			m_environmentData.m_environmentBright = 1;
		}

		//Random Temperature
		m_environmentData.m_environmentTemperature 	= 15 	+ 	((uint64_t)rand()*10)	/RAND_MAX; //15-25 °C
		m_environmentData.m_environmentAirPressure 	= 980 	+ 	((uint64_t)rand()*40)	/RAND_MAX; //980-1020 mBar
		m_environmentData.m_environmentCO2 			= 400 	+ 	((uint64_t)rand()*20)	/RAND_MAX; //400-420 ppm
		m_environmentData.m_environmentAirHumidity 	= 			((uint64_t)rand()*100)	/RAND_MAX; //0-100 %
		m_environmentData.m_environmentVOC 			= 20    +	((uint64_t)rand()*200)	/RAND_MAX; //20-220 ppb

		m_environmentData.m_isUpdateAvailable = TRUE;
#endif

		//Ausgangsansteuerung prüfen
		if(		(m_environmentData.m_environmentTemperature > m_environmentData.m_criticTemperature)
			|| 	(m_environmentData.m_environmentVOC 		> m_environmentData.m_criticVOC)
			|| 	(m_environmentData.m_environmentCO2 		> m_environmentData.m_criticCo2)
			|| 	(m_environmentData.m_environmentAirHumidity > m_environmentData.m_criticHumidity)
			|| 	(m_environmentData.m_environmentAirPressure > m_environmentData.m_criticPressure))
		{
			m_environmentData.m_outputActive = TRUE;
		}
		else
		{
			m_environmentData.m_outputActive = FALSE;
		}

		//Update senden?
		if((m_environmentData.m_isUpdateAvailable) &&
				(((uint32_t)m_environmentData.m_repRateBT) * (uint32_t)2000) <= (msSinceUpdate * (uint32_t)2))
		{
			LGS_UpdateStackData();
			m_environmentData.m_isUpdateAvailable = FALSE;
			msSinceUpdate = 0;
		}


		HAL_Delay(LGS_LOOPINTERVAL);
		msSinceUpdate += LGS_LOOPINTERVAL;
	}
}

/**
 * Updated alle Daten im BLE Stack
 */
tBleStatus LGS_UpdateStackData(void)
{
	tBleStatus status;

	//Bright Flag
	status = aci_gatt_update_char_value(
			m_serviceHandles.m_environmentServiceHandle, 	//Service Handle
			m_serviceHandles.m_environmentCharBrightHandle,	//Characteristic Handle
			0, 												//Offset
			2+sizeof(m_environmentData.m_environmentBright), 	//LEN
			&m_environmentData.m_environmentBright);		//const void *  charValue
	if(status != BLE_STATUS_SUCCESS) goto fail;

	//Temperature
	status = aci_gatt_update_char_value(
			m_serviceHandles.m_environmentServiceHandle, 	//Service Handle
			m_serviceHandles.m_environmentCharTempHandle,	//Characteristic Handle
			0, 												//Offset
			2+sizeof(m_environmentData.m_environmentTemperature), //LEN
			&m_environmentData.m_environmentTemperature);		//const void *  charValue
	if(status != BLE_STATUS_SUCCESS) goto fail;

	//Pressure
	status = aci_gatt_update_char_value(
			m_serviceHandles.m_environmentServiceHandle, 	//Service Handle
			m_serviceHandles.m_environmentCharPressureHandle,	//Characteristic Handle
			0, 													//Offset
			2+sizeof(m_environmentData.m_environmentAirPressure), //LEN
			&m_environmentData.m_environmentAirPressure);		//const void *  charValue
	if(status != BLE_STATUS_SUCCESS) goto fail;

	//CO2
	status = aci_gatt_update_char_value(
			m_serviceHandles.m_environmentServiceHandle, 	//Service Handle
			m_serviceHandles.m_environmentCharCO2Handle,	//Characteristic Handle
			0, 												//Offset
			2+sizeof(m_environmentData.m_environmentCO2), 	//LEN
			&m_environmentData.m_environmentCO2);			//const void *  charValue
	if(status != BLE_STATUS_SUCCESS) goto fail;

