tiedemannt/STM32AtollicApp/Src/lgs_bluetooth.c
	//Humidity
	status = aci_gatt_update_char_value(
			m_serviceHandles.m_environmentServiceHandle, 	//Service Handle
			m_serviceHandles.m_environmentCharHumidityHandle,//Characteristic Handle
			0, 													//Offset
			2+sizeof(m_environmentData.m_environmentAirHumidity), //LEN
			&m_environmentData.m_environmentAirHumidity);		//const void *  charValue
	if(status != BLE_STATUS_SUCCESS) goto fail;

	//VOC
	status = aci_gatt_update_char_value(
			m_serviceHandles.m_environmentServiceHandle, 	//Service Handle
			m_serviceHandles.m_environmentCharVOCHandle,	//Characteristic Handle
			0, 												//Offset
			2+sizeof(m_environmentData.m_environmentVOC), 	//LEN
			&m_environmentData.m_environmentVOC);			//const void *  charValue
	if(status != BLE_STATUS_SUCCESS) goto fail;

	//Output Active Flag:
	status = aci_gatt_update_char_value(
			m_serviceHandles.m_configurationServiceHandle, 	//Service Handle
			m_serviceHandles.m_configurationsOutputActive,	//Characteristic Handle
			0, 												//Offset
			2+sizeof(m_environmentData.m_outputActive), 	//LEN
			&m_environmentData.m_outputActive);				//const void *  charValue
	if(status != BLE_STATUS_SUCCESS) goto fail;


	return BLE_STATUS_SUCCESS;

	fail:
	  return BLE_STATUS_ERROR;
}


/*
 * Updated die Settings
 */
void LGS_BLE_UpdateDefaultSettings(void)
{
	//Reprate:
	(void)aci_gatt_update_char_value(
			m_serviceHandles.m_configurationServiceHandle, 				//Service Handle
			m_serviceHandles.m_configurationsRepRateHandle,  			//Characteristic Handle
			0, 															//Offset
			2+sizeof(m_environmentData.m_repRateBT), 					//LEN
			&m_environmentData.m_repRateBT);							//const void *  charValue

	//Critic Temperature:
	(void)aci_gatt_update_char_value(
				m_serviceHandles.m_configurationServiceHandle, 				//Service Handle
				m_serviceHandles.m_configurationsCriticTemperature,  		//Characteristic Handle
				0, 															//Offset
				2+sizeof(m_environmentData.m_criticTemperature), 			//LEN
				&m_environmentData.m_criticTemperature);					//const void *  charValue

	//Critic VOC:
	(void)aci_gatt_update_char_value(
				m_serviceHandles.m_configurationServiceHandle, 				//Service Handle
				m_serviceHandles.m_configurationsCriticVOC,  				//Characteristic Handle
				0, 															//Offset
				2+sizeof(m_environmentData.m_criticVOC), 					//LEN
				&m_environmentData.m_criticVOC);							//const void *  charValue

	//Critic CO2:
	(void)aci_gatt_update_char_value(
				m_serviceHandles.m_configurationServiceHandle, 				//Service Handle
				m_serviceHandles.m_configurationsCriticCo2,  				//Characteristic Handle
				0, 															//Offset
				2+sizeof(m_environmentData.m_criticCo2), 					//LEN
				&m_environmentData.m_criticCo2);							//const void *  charValue

	//Critic Humidity:
	(void)aci_gatt_update_char_value(
				m_serviceHandles.m_configurationServiceHandle, 				//Service Handle
				m_serviceHandles.m_configurationsCriticHumidity,  			//Characteristic Handle
				0, 															//Offset
				2+sizeof(m_environmentData.m_criticHumidity), 				//LEN
				&m_environmentData.m_criticHumidity);						//const void *  charValue

	//Critic Pressure:
	(void)aci_gatt_update_char_value(
				m_serviceHandles.m_configurationServiceHandle, 				//Service Handle
				m_serviceHandles.m_configurationsCriticPressure,  			//Characteristic Handle
				0, 															//Offset
				2+sizeof(m_environmentData.m_criticPressure), 				//LEN
				&m_environmentData.m_criticPressure);						//const void *  charValue

	//Output Active Flag:
	(void)aci_gatt_update_char_value(
				m_serviceHandles.m_configurationServiceHandle, 				//Service Handle
				m_serviceHandles.m_configurationsOutputActive,  			//Characteristic Handle
				0, 															//Offset
				2+sizeof(m_environmentData.m_outputActive), 				//LEN
				&m_environmentData.m_outputActive);							//const void *  charValue

	m_environmentData.m_isUpdateAvailable = TRUE;
}


/**
 * Setzt das Device in Connectable Mode
 */
void LGS_SetDiscoverableMode(void)
{
	uint8_t ret;
	const char local_name[] = {AD_TYPE_COMPLETE_LOCAL_NAME, LGS_MOD_NAME};

#define LEN (22)							//Length of manuf_data
	uint8_t manuf_data[LEN] = {
			0x02,	0x0A,	0x04, 			//Length: 2 Byte; Type: TransmissionPower; Value: 4dBm
			0x0A,	0x09,	LGS_MOD_NAME, 	//Length: 10Byte; Type: Full Device Name; Value: LGS_MOD_NAME
			0x07, 	0xFF,					//Length: 7 Byte; Type: SKD Version; Value: MAC Adress
			bdaddr[0], /* BLE MAC start */
			bdaddr[1],
			bdaddr[2],
			bdaddr[3],
			bdaddr[4],
			bdaddr[5]  /* BLE MAC stop */
	};

	hci_le_set_scan_resp_data(0, NULL);

	PRINTF("Set General Discoverable Mode.\n");

	//The device will be discoverable until the Host issue Aci_Gap_Set_Non_Discoverable command:
	ret = aci_gap_set_discoverable(
			ADV_IND,							//AdvType: Connectable undirected advertising
			(ADV_INTERVAL_MIN_MS*1000)/625,		//Minimum advertising interval
			(ADV_INTERVAL_MAX_MS*1000)/625,		//Maximum advertising interval
			STATIC_RANDOM_ADDR,					//Type of our address used during advertising (PUBLIC_ADDR,STATIC_RANDOM_ADDR).
			NO_WHITE_LIST_USE,					//Filter policy
			sizeof(local_name),					//Length of LocalName array.
			local_name,							//Array containing the Local Name AD data. First byte is the AD type
			0,									//Length of ServiceUUIDList array.
			NULL,								//ServiceUUIDList
			0,									//Slave connection interval minimum value suggested by Peripheral.
			0);									//Slave connection interval maximum value suggested by Peripheral.
	//-> If SlaveConnIntervMin and SlaveConnIntervMax are not 0x0000, Slave Connection Interval Range AD structure will be
	//added in advertising data. Connection interval is defined in the following manner:
	//connIntervalmin = Slave_Conn_Interval_Min x 1.25ms Slave_Conn_Interval_Min range:
	//0x0006 to 0x0C80 Value of 0xFFFF indicates no specific minimum.
	// ---> beide 0 lassen

	//Update advertising data:
	aci_gap_update_adv_data(
			LEN, 				//LEN
			manuf_data);		//Data Struct
#undef LEN						//Delete Symbol LEN; not further needed

	if(ret != BLE_STATUS_SUCCESS)
	{
		PRINTF("aci_gap_set_discoverable() failed: 0x%02x\r\n", ret);
	}
	else
		PRINTF("aci_gap_set_discoverable() --> SUCCESS\r\n");
}



/**
 * @brief  Add the Environment Service
 * @param  None
 * @retval tBleStatus Status
 */
tBleStatus LGS_AddEnvironmentService(void)
{
  tBleStatus ret;
  int32_t NumberOfRecords=6;		// NUMBER OF RECORDS
  uint8_t uuid[16];

