tiedemannt/STM32AtollicApp/Src/lgs_bluetooth.c
  //###################################################################################################################################
  //Add Service
  //###################################################################################################################################
  GET_ENVIRONMENT_SERVICE_UUID(uuid);
  memcpy(&service_uuid.Service_UUID_128, uuid, 16);		//Dest, Source, Length
  ret = aci_gatt_add_serv(
		  UUID_TYPE_128, 								//UUID Type: 16/128 bit
		  service_uuid.Service_UUID_128, 				//16-bit or 128-bit UUID based on the UUID Type field; requests const uint8_t *
		  PRIMARY_SERVICE,								//Primary or secondary service
          1+3*NumberOfRecords, 							//Maximum number of attribute records(including the service declaration itself)
		  &m_serviceHandles.m_environmentServiceHandle);//Service Handle
  if (ret != BLE_STATUS_SUCCESS)
  {
    goto fail;
  }

  //###################################################################################################################################
  //Add READONLY Characteristics to New Service
  //###################################################################################################################################

  //Bright Char
  //###################################################################################################################################
  GET_ENVIRONMENT_CHAR_BRIGHT_UUID(uuid);
  memcpy(&char_uuid.Char_UUID_128, uuid, 16); //Dest, Source, Length
  ret =  aci_gatt_add_char(m_serviceHandles.m_environmentServiceHandle,//Handle of the service to which the characteristic has to be added.
		  UUID_TYPE_128,											//UUID Type: 16/128 bit
		  char_uuid.Char_UUID_128,									//Requests const uint8_t *
		  2+sizeof(m_environmentData.m_environmentBright),			//Länge
		  CHAR_PROP_NOTIFY,											//Bitwise OR values of Characteristic Properties; def: CHAR_PROP_NOTIFY
          ATTR_PERMISSION_NONE,										//Security permissions for the added characteristic
          GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,				//Bit mask gattEvtMask
          16,														//encryKeySize 7-16bit
		  0,														//If the attribute has a variable length value field (1) or not (0).
		  &m_serviceHandles.m_environmentCharBrightHandle);			//Handle of the Characteristic that has been added.
  if (ret != BLE_STATUS_SUCCESS) {
    goto fail;
  }

  //Temperature Char
  //###################################################################################################################################
  GET_ENVIRONMENT_CHAR_TEMP_UUID(uuid);
  memcpy(&char_uuid.Char_UUID_128, uuid, 16); //Dest, Source, Length
  ret =  aci_gatt_add_char(m_serviceHandles.m_environmentServiceHandle, //Handle of the service to which the characteristic has to be added.
		  UUID_TYPE_128,											//UUID Type: 16/128 bit
		  char_uuid.Char_UUID_128,									//Requests const uint8_t *
		  2+sizeof(m_environmentData.m_environmentTemperature),		//Länge
		  CHAR_PROP_NOTIFY,											//Bitwise OR values of Characteristic Properties; def: CHAR_PROP_NOTIFY
		  ATTR_PERMISSION_NONE,										//Security permissions for the added characteristic
		  GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,				//Bit mask gattEvtMask
		  16,														//encryKeySize 7-16bit
		  0,														//If the attribute has a variable length value field (1) or not (0).
		  &m_serviceHandles.m_environmentCharTempHandle);			//Handle of the Characteristic that has been added.
  if (ret != BLE_STATUS_SUCCESS) {
	  goto fail;
  }

  //VOC Char
  //###################################################################################################################################
  GET_ENVIRONMENT_CHAR_VOC_UUID(uuid);
  memcpy(&char_uuid.Char_UUID_128, uuid, 16); //Dest, Source, Length
  ret =  aci_gatt_add_char(m_serviceHandles.m_environmentServiceHandle, //Handle of the service to which the characteristic has to be added.
		  UUID_TYPE_128,											//UUID Type: 16/128 bit
		  char_uuid.Char_UUID_128,									//Requests const uint8_t *
		  2+sizeof(m_environmentData.m_environmentVOC),				//Länge
		  CHAR_PROP_NOTIFY,											//Bitwise OR values of Characteristic Properties; def: CHAR_PROP_NOTIFY
		  ATTR_PERMISSION_NONE,										//Security permissions for the added characteristic
		  GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,				//Bit mask gattEvtMask
		  16,														//encryKeySize 7-16bit
		  0,														//If the attribute has a variable length value field (1) or not (0).
		  &m_serviceHandles.m_environmentCharVOCHandle);			//Handle of the Characteristic that has been added.
  if (ret != BLE_STATUS_SUCCESS) {
	  goto fail;
  }

  //CO2 Char
  //###################################################################################################################################
  GET_ENVIRONMENT_CHAR_CO2_UUID(uuid);
  memcpy(&char_uuid.Char_UUID_128, uuid, 16); //Dest, Source, Length
  ret =  aci_gatt_add_char(m_serviceHandles.m_environmentServiceHandle, //Handle of the service to which the characteristic has to be added.
		  UUID_TYPE_128,											//UUID Type: 16/128 bit
		  char_uuid.Char_UUID_128,									//Requests const uint8_t *
		  2+sizeof(m_environmentData.m_environmentCO2),				//Länge
		  CHAR_PROP_NOTIFY,											//Bitwise OR values of Characteristic Properties; def: CHAR_PROP_NOTIFY
		  ATTR_PERMISSION_NONE,										//Security permissions for the added characteristic
		  GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,				//Bit mask gattEvtMask
		  16,														//encryKeySize 7-16bit
		  0,														//If the attribute has a variable length value field (1) or not (0).
		  &m_serviceHandles.m_environmentCharCO2Handle);			//Handle of the Characteristic that has been added.
  if (ret != BLE_STATUS_SUCCESS) {
	  goto fail;
  }

  //Humidity Char
  //###################################################################################################################################
  GET_ENVIRONMENT_CHAR_HUMIDITY_UUID(uuid);
  memcpy(&char_uuid.Char_UUID_128, uuid, 16); //Dest, Source, Length
  ret =  aci_gatt_add_char(m_serviceHandles.m_environmentServiceHandle, //Handle of the service to which the characteristic has to be added.
		  UUID_TYPE_128,											//UUID Type: 16/128 bit
		  char_uuid.Char_UUID_128,									//Requests const uint8_t *
		  2+sizeof(m_environmentData.m_environmentAirHumidity),		//Länge
		  CHAR_PROP_NOTIFY,											//Bitwise OR values of Characteristic Properties; def: CHAR_PROP_NOTIFY
		  ATTR_PERMISSION_NONE,										//Security permissions for the added characteristic
		  GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,				//Bit mask gattEvtMask
		  16,														//encryKeySize 7-16bit
		  0,														//If the attribute has a variable length value field (1) or not (0).
		  &m_serviceHandles.m_environmentCharHumidityHandle);		//Handle of the Characteristic that has been added.
  if (ret != BLE_STATUS_SUCCESS) {
	  goto fail;
  }

  //Air Pressure Char
  //###################################################################################################################################
  GET_ENVIRONMENT_CHAR_PRESSURE_UUID(uuid);
  memcpy(&char_uuid.Char_UUID_128, uuid, 16); //Dest, Source, Length
  ret =  aci_gatt_add_char(m_serviceHandles.m_environmentServiceHandle, //Handle of the service to which the characteristic has to be added.
		  UUID_TYPE_128,											//UUID Type: 16/128 bit
		  char_uuid.Char_UUID_128,									//Requests const uint8_t *
		  2+sizeof(m_environmentData.m_environmentAirPressure),		//Länge
		  CHAR_PROP_NOTIFY,											//Bitwise OR values of Characteristic Properties; def: CHAR_PROP_NOTIFY
		  ATTR_PERMISSION_NONE,										//Security permissions for the added characteristic
		  GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,				//Bit mask gattEvtMask
		  16,														//encryKeySize 7-16bit
		  0,														//If the attribute has a variable length value field (1) or not (0).
		  &m_serviceHandles.m_environmentCharPressureHandle);		//Handle of the Characteristic that has been added.
  if (ret != BLE_STATUS_SUCCESS) {
	  goto fail;
  }





