tiedemannt/STM32AtollicApp/Src/lgs_bluetooth.c
  //###################################################################################################################################
  //Add CONFIGURATION Service
  //###################################################################################################################################
  NumberOfRecords = 7; //Records for CONFIGURATION SERVICE

  GET_CONFIGURATION_SERVICE_UUID(uuid);
  memcpy(&service_uuid.Service_UUID_128, uuid, 16);		//Dest, Source, Length
  ret = aci_gatt_add_serv(
		  UUID_TYPE_128, 									//UUID Type: 16/128 bit
		  service_uuid.Service_UUID_128, 					//16-bit or 128-bit UUID based on the UUID Type field; requests const uint8_t *
		  PRIMARY_SERVICE,									//Primary or secondary service
		  1+3*NumberOfRecords, 								//Maximum number of attribute records(including the service declaration itself)
		  &m_serviceHandles.m_configurationServiceHandle);	//Service Handle
  if (ret != BLE_STATUS_SUCCESS)
  {
	  goto fail;
  }

  //Repetition Rate
    //###################################################################################################################################
  	GET_ENVIRONMENT_CHAR_SETTINGS_REPRATE_UUID(uuid);
    memcpy(&char_uuid.Char_UUID_128, uuid, 16); //Dest, Source, Length
    ret =  aci_gatt_add_char(m_serviceHandles.m_configurationServiceHandle,//Handle of the service to which the characteristic has to be added.
  		  UUID_TYPE_128,											//UUID Type: 16/128 bit
  		  char_uuid.Char_UUID_128,									//Requests const uint8_t *
  		  2+sizeof(m_environmentData.m_repRateBT),					//Länge
  		  CHAR_PROP_WRITE | CHAR_PROP_READ,							//Bitwise OR values of Characteristic Properties; def: CHAR_PROP_WRITE
  		  // Alternativ ggf: CHAR_PROP_WRITE_WITHOUT_RESP ?
  		  ATTR_PERMISSION_NONE,										//Security permissions for the added characteristic
  		  GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP |
  		  GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,				//Bit mask gattEvtMask
  		  // Alternativ: GATT_NOTIFY_ATTRIBUTE_WRITE ?
  		  16,														//encryKeySize 7-16bit
  		  0,														//If the attribute has a variable length value field (1) or not (0).
  		  &m_serviceHandles.m_configurationsRepRateHandle);			//Handle of the Characteristic that has been added.
    if (ret != BLE_STATUS_SUCCESS) {
  	  goto fail;
    }

  //Critic Temperature
    //###################################################################################################################################
    GET_ENVIRONMENT_CHAR_SETTINGS_CRITTEMP_UUID(uuid);
    memcpy(&char_uuid.Char_UUID_128, uuid, 16); //Dest, Source, Length
    ret =  aci_gatt_add_char(m_serviceHandles.m_configurationServiceHandle,//Handle of the service to which the characteristic has to be added.
    		UUID_TYPE_128,											//UUID Type: 16/128 bit
			char_uuid.Char_UUID_128,								//Requests const uint8_t *
			2+sizeof(m_environmentData.m_criticTemperature),		//Länge
			CHAR_PROP_WRITE | CHAR_PROP_READ,						//Bitwise OR values of Characteristic Properties; def: CHAR_PROP_WRITE
			// Alternativ ggf: CHAR_PROP_WRITE_WITHOUT_RESP ?
			ATTR_PERMISSION_NONE,									//Security permissions for the added characteristic
			GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP |
			GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,			//Bit mask gattEvtMask
			// Alternativ: GATT_NOTIFY_ATTRIBUTE_WRITE ?
			16,														//encryKeySize 7-16bit
			0,														//If the attribute has a variable length value field (1) or not (0).
			&m_serviceHandles.m_configurationsCriticTemperature);	//Handle of the Characteristic that has been added.
    if (ret != BLE_STATUS_SUCCESS) {
    	goto fail;
    }

    //Critic VOC
    //###################################################################################################################################
    GET_ENVIRONMENT_CHAR_SETTINGS_CRITVOC_UUID(uuid);
    memcpy(&char_uuid.Char_UUID_128, uuid, 16); //Dest, Source, Length
    ret =  aci_gatt_add_char(m_serviceHandles.m_configurationServiceHandle,//Handle of the service to which the characteristic has to be added.
    		UUID_TYPE_128,											//UUID Type: 16/128 bit
			char_uuid.Char_UUID_128,								//Requests const uint8_t *
			2+sizeof(m_environmentData.m_criticVOC),				//Länge
			CHAR_PROP_WRITE | CHAR_PROP_READ,						//Bitwise OR values of Characteristic Properties; def: CHAR_PROP_WRITE
			// Alternativ ggf: CHAR_PROP_WRITE_WITHOUT_RESP ?
			ATTR_PERMISSION_NONE,									//Security permissions for the added characteristic
			GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP |
			GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,			//Bit mask gattEvtMask
			// Alternativ: GATT_NOTIFY_ATTRIBUTE_WRITE ?
			16,														//encryKeySize 7-16bit
			0,														//If the attribute has a variable length value field (1) or not (0).
			&m_serviceHandles.m_configurationsCriticVOC);			//Handle of the Characteristic that has been added.
    if (ret != BLE_STATUS_SUCCESS) {
    	goto fail;
    }

    //Critic CO2
    //###################################################################################################################################
    GET_ENVIRONMENT_CHAR_SETTINGS_CRITCO2_UUID(uuid);
    memcpy(&char_uuid.Char_UUID_128, uuid, 16); //Dest, Source, Length
    ret =  aci_gatt_add_char(m_serviceHandles.m_configurationServiceHandle,//Handle of the service to which the characteristic has to be added.
    		UUID_TYPE_128,											//UUID Type: 16/128 bit
			char_uuid.Char_UUID_128,								//Requests const uint8_t *
			2+sizeof(m_environmentData.m_criticCo2),				//Länge
			CHAR_PROP_WRITE | CHAR_PROP_READ,						//Bitwise OR values of Characteristic Properties; def: CHAR_PROP_WRITE
			// Alternativ ggf: CHAR_PROP_WRITE_WITHOUT_RESP ?
			ATTR_PERMISSION_NONE,									//Security permissions for the added characteristic
			GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP |
			GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,			//Bit mask gattEvtMask
			// Alternativ: GATT_NOTIFY_ATTRIBUTE_WRITE ?
			16,														//encryKeySize 7-16bit
			0,														//If the attribute has a variable length value field (1) or not (0).
			&m_serviceHandles.m_configurationsCriticCo2);			//Handle of the Characteristic that has been added.
    if (ret != BLE_STATUS_SUCCESS) {
    	goto fail;
    }

