tiedemannt/STM32AtollicApp/Src/lgs_bluetooth.c
    //Critic Humidity
    //###################################################################################################################################
    GET_ENVIRONMENT_CHAR_SETTINGS_CRITHUM_UUID(uuid);
    memcpy(&char_uuid.Char_UUID_128, uuid, 16); //Dest, Source, Length
    ret =  aci_gatt_add_char(m_serviceHandles.m_configurationServiceHandle,//Handle of the service to which the characteristic has to be added.
    		UUID_TYPE_128,											//UUID Type: 16/128 bit
			char_uuid.Char_UUID_128,								//Requests const uint8_t *
			2+sizeof(m_environmentData.m_criticHumidity),			//Länge
			CHAR_PROP_WRITE | CHAR_PROP_READ,						//Bitwise OR values of Characteristic Properties; def: CHAR_PROP_WRITE
			// Alternativ ggf: CHAR_PROP_WRITE_WITHOUT_RESP ?
			ATTR_PERMISSION_NONE,									//Security permissions for the added characteristic
			GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP |
			GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,			//Bit mask gattEvtMask
			// Alternativ: GATT_NOTIFY_ATTRIBUTE_WRITE ?
			16,														//encryKeySize 7-16bit
			0,														//If the attribute has a variable length value field (1) or not (0).
			&m_serviceHandles.m_configurationsCriticHumidity);		//Handle of the Characteristic that has been added.
    if (ret != BLE_STATUS_SUCCESS) {
    	goto fail;
    }

    //Critic Pressure
    //###################################################################################################################################
    GET_ENVIRONMENT_CHAR_SETTINGS_CRITPRES_UUID(uuid);
    memcpy(&char_uuid.Char_UUID_128, uuid, 16); //Dest, Source, Length
    ret =  aci_gatt_add_char(m_serviceHandles.m_configurationServiceHandle,//Handle of the service to which the characteristic has to be added.
    		UUID_TYPE_128,											//UUID Type: 16/128 bit
			char_uuid.Char_UUID_128,								//Requests const uint8_t *
			2+sizeof(m_environmentData.m_criticPressure),			//Länge
			CHAR_PROP_WRITE | CHAR_PROP_READ,						//Bitwise OR values of Characteristic Properties; def: CHAR_PROP_WRITE
			// Alternativ ggf: CHAR_PROP_WRITE_WITHOUT_RESP ?
			ATTR_PERMISSION_NONE,									//Security permissions for the added characteristic
			GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP |
			GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,			//Bit mask gattEvtMask
			// Alternativ: GATT_NOTIFY_ATTRIBUTE_WRITE ?
			16,														//encryKeySize 7-16bit
			0,														//If the attribute has a variable length value field (1) or not (0).
			&m_serviceHandles.m_configurationsCriticPressure);		//Handle of the Characteristic that has been added.
    if (ret != BLE_STATUS_SUCCESS) {
    	goto fail;
    }

  //Output Active Flag
  //###################################################################################################################################
  GET_ENVIRONMENT_CHAR_SETTINGS_OUTPUTACT_UUID(uuid);
  memcpy(&char_uuid.Char_UUID_128, uuid, 16); //Dest, Source, Length
  ret =  aci_gatt_add_char(m_serviceHandles.m_configurationServiceHandle,//Handle of the service to which the characteristic has to be added.
		  UUID_TYPE_128,											//UUID Type: 16/128 bit
		  char_uuid.Char_UUID_128,									//Requests const uint8_t *
		  2+sizeof(m_environmentData.m_outputActive),				//Länge
		  CHAR_PROP_NOTIFY,											//CHAR_PROP_NOTIFY
		  ATTR_PERMISSION_NONE,										//Security permissions for the added characteristic
		  GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,				//Bit mask gattEvtMask
		  16,														//encryKeySize 7-16bit
		  0,														//If the attribute has a variable length value field (1) or not (0).
		  &m_serviceHandles.m_configurationsOutputActive);			//Handle of the Characteristic that has been added.
  if (ret != BLE_STATUS_SUCCESS) {
	  goto fail;
  }





  return BLE_STATUS_SUCCESS;

  //###################################################################################################################################
fail:
  return BLE_STATUS_ERROR;
}


/**
 * @brief  Callback processing the ACI events.
 * @note   Inside this function each event must be identified and correctly
 *         parsed.
 * @param  void* Pointer to the ACI packet
 * @retval None
 */
void LGS_UserNotify(void * pData)
{
	hci_uart_pckt *hci_pckt = pData;
	/* obtain event packet */
	hci_event_pckt *event_pckt = (hci_event_pckt*)hci_pckt->data;

	if(hci_pckt->type != HCI_EVENT_PKT)
		return;

	switch(event_pckt->evt)
	{
	case EVT_DISCONN_COMPLETE:
	{
		GAP_DisconnectionComplete_CB();
	}
	break;

	case EVT_LE_META_EVENT:
	{
		evt_le_meta_event *evt = (void *)event_pckt->data;

		switch(evt->subevent)
		{
		case EVT_LE_CONN_COMPLETE:
		{
			evt_le_connection_complete *cc = (void *)evt->data;
			GAP_ConnectionComplete_CB(cc->peer_bdaddr, cc->handle);
		}
		break;
		}
	}
	break;

	case EVT_VENDOR:
	{
		evt_blue_aci *blue_evt = (void*)event_pckt->data;
		switch(blue_evt->ecode)
		{
		// Read Request empfangen
		case EVT_BLUE_GATT_READ_PERMIT_REQ:
		{
			evt_gatt_read_permit_req *pr = (void*)blue_evt->data;
			Read_Request_CB(pr->attr_handle);
			break;
		}


		// Write Request empfangen
		case EVT_BLUE_GATT_WRITE_PERMIT_REQ:
		{
			evt_gatt_write_permit_req *pr = (void*)blue_evt->data;
			Write_Request_CB(pr->attr_handle, pr->data_length, pr->data);
			break;
		}

		}

	}
	break;
	}
}

/**
 * @brief  This function is called when the peer device gets disconnected.
 * @param  None
 * @retval None
 */
void GAP_DisconnectionComplete_CB(void)
{
  connected = FALSE;
  PRINTF("Disconnected\n");
  /* Make the device connectable again. */
  set_connectable = TRUE;
  notification_enabled = FALSE;
}

/**
 * @brief  This function is called when there is a LE Connection Complete event.
 * @param  uint8_t Address of peer device
 * @param  uint16_t Connection handle
 * @retval None
 */
void GAP_ConnectionComplete_CB(uint8_t addr[6], uint16_t handle)
{
  connected = TRUE;
  connection_handle = handle;

  PRINTF("Connected to device:");
  for(uint32_t i = 5; i > 0; i--){
    PRINTF("%02X-", addr[i]);
  }
  PRINTF("%02X\n", addr[0]);
}


