tiedemannt/STM32AtollicApp/Src/lgs_bluetooth.c
/*******************************************************************************
* Function Name  : Read_Request_CB.
* Description    : Update the sensor valuse.
* Input          : Handle of the characteristic to update.
* Return         : None.
*******************************************************************************/
void Read_Request_CB(uint16_t handle)
{
  tBleStatus ret;

  if(connection_handle !=0)
  {
    ret = aci_gatt_allow_read(connection_handle);
    if (ret != BLE_STATUS_SUCCESS)
    {
      PRINTF("aci_gatt_allow_read() failed: 0x%02x\r\n", ret);
    }
  }
}


/*******************************************************************************
* Function Name  : Write_Request_CB.
* Description    : Handle Write Request
* Input          : - Handle of the characteristic to write.
* 				   - Length of Data received
* 				   - Received Data
* Return         : None.
*******************************************************************************/
void Write_Request_CB(uint16_t handle, uint8_t data_length, uint8_t* data)
{
	tBleStatus ret;

	if(connection_handle !=0)
	{
		uint8_t write_status = ERR_WRITE_STATUS_OK;
		uint8_t error_code	 = ERR_CODE_NO_ERROR;

		if(m_serviceHandles.m_configurationsRepRateHandle == (handle - 1))
		{
			uint16_t receivedRepRate = *((uint16_t*)data);
			if((receivedRepRate <= LGS_CYCLIC_SEND_INTERVAL_MAX)
					&& (receivedRepRate >= LGS_CYCLIC_SEND_INTERVAL_MIN))
			{
				//OK
				m_environmentData.m_repRateBT = receivedRepRate;
			}
			else
			{
				write_status = ERR_WRITE_STATUS_NOK;
				error_code	 = ERR_CODE_VALUE_NOK;
			}
		}
		else if(m_serviceHandles.m_configurationsCriticTemperature == (handle - 1))
		{
			uint16_t receivedCritTemp = *((int8_t*)data);
			if((receivedCritTemp <= LGS_CYCLIC_CRITICTEMP_MAX)
					&& (receivedCritTemp >= LGS_CYCLIC_CRITICTEMP_MIN))
			{
				//OK
				m_environmentData.m_criticTemperature = receivedCritTemp;
			}
			else
			{
				write_status = ERR_WRITE_STATUS_NOK;
				error_code	 = ERR_CODE_VALUE_NOK;
			}
		}
		else if(m_serviceHandles.m_configurationsCriticVOC == (handle - 1))
		{
			uint16_t receivedCritVOC = *((uint16_t*)data);
			if((receivedCritVOC <= LGS_CYCLIC_CRITICVOC_MAX)
					&& (receivedCritVOC >= LGS_CYCLIC_CRITICVOC_MIN))
			{
				//OK
				m_environmentData.m_criticVOC = receivedCritVOC;
			}
			else
			{
				write_status = ERR_WRITE_STATUS_NOK;
				error_code	 = ERR_CODE_VALUE_NOK;
			}
		}
		else if(m_serviceHandles.m_configurationsCriticCo2 == (handle - 1))
		{
			uint16_t receivedCritCO2 = *((uint16_t*)data);
			if((receivedCritCO2 <= LGS_CYCLIC_CRITICCO2_MAX)
					&& (receivedCritCO2 >= LGS_CYCLIC_CRITICCO2_MIN))
			{
				//OK
				m_environmentData.m_criticCo2 = receivedCritCO2;
			}
			else
			{
				write_status = ERR_WRITE_STATUS_NOK;
				error_code	 = ERR_CODE_VALUE_NOK;
			}
		}
		else if(m_serviceHandles.m_configurationsCriticHumidity == (handle - 1))
		{
			uint16_t receivedCritHumidity = *((uint8_t*)data);
			if((receivedCritHumidity <= LGS_CYCLIC_CRITICHUMIDITY_MAX)
					&& (receivedCritHumidity >= LGS_CYCLIC_CRITICHUMIDITY_MIN))
			{
				//OK
				m_environmentData.m_criticHumidity = receivedCritHumidity;
			}
			else
			{
				write_status = ERR_WRITE_STATUS_NOK;
				error_code	 = ERR_CODE_VALUE_NOK;
			}
		}
		else if(m_serviceHandles.m_configurationsCriticPressure == (handle - 1))
		{
			uint16_t receivedCritPressure = *((uint16_t*)data);
			if((receivedCritPressure <= LGS_CYCLIC_CRITICPRESSURE_MAX)
					&& (receivedCritPressure >= LGS_CYCLIC_CRITICPRESSURE_MIN))
			{
				//OK
				m_environmentData.m_criticPressure = receivedCritPressure;
			}
			else
			{
				write_status = ERR_WRITE_STATUS_NOK;
				error_code	 = ERR_CODE_VALUE_NOK;
			}
		}
		else
		{
			write_status = ERR_WRITE_STATUS_NOK;
			error_code = ERR_CODE_UNKNOWN_ATTR;
		}

		ret = aci_gatt_write_response(
				connection_handle,
				handle,
				write_status, 	//Write Status
				error_code,		//Fehlercode
				data_length,
				data
		);

		if (ret != BLE_STATUS_SUCCESS)
		{
			PRINTF("aci_gatt_allow_read() failed: 0x%02x\r\n", ret);
		}
	}
}

























